Remove duplicate rows.

Replace values in a column (Male → M, Female → F).

Strip whitespace from string columns.

Convert a date column to datetime.

Extract year, month, day from a datetime column.

Create a new column using existing columns.

Apply a function to a column using:

apply

Sort data by one column.

Sort data by multiple columns.

In [35]:
import pandas as pd

In [36]:
df = pd.read_csv("../Data/pandas_practice_data.csv")

In [37]:
df2 = df.copy()

In [38]:
df2["Age"] = df2["Age"].fillna(df2["Age"].mean())

In [39]:
df2

   EmployeeID   Name        Age Department   Salary    City
0         101   Amit  23.000000         HR  25000.0   Delhi
1         102   Riya  29.000000         IT  45000.0  Mumbai
2         103   John  35.000000         IT  60000.0   Delhi
3         104   Neha  31.333333    Finance  52000.0    Pune
4         105  Karan  41.000000         HR      NaN  Mumbai
5         106   Sara  28.000000    Finance  48000.0   Delhi
6         107  Vikas  31.333333         IT  70000.0    Pune
7         108  Anita  32.000000         HR      NaN  Mumbai

In [40]:
#1. Change column data type (object → int).
df2["Age"] = df2["Age"].astype(int)

In [42]:
df2

   EmployeeID   Name  Age Department   Salary    City
0         101   Amit   23         HR  25000.0   Delhi
1         102   Riya   29         IT  45000.0  Mumbai
2         103   John   35         IT  60000.0   Delhi
3         104   Neha   31    Finance  52000.0    Pune
4         105  Karan   41         HR      NaN  Mumbai
5         106   Sara   28    Finance  48000.0   Delhi
6         107  Vikas   31         IT  70000.0    Pune
7         108  Anita   32         HR      NaN  Mumbai